content-org/javascript/org/code-question.org
#+TITLE: js 常见题
#+DATE:<2022-11-29 Tue 09:50>
#+FILETAGS: coding-question

* 大数相加

思路：从右到左循环去加

#+begin_src js

/**
 ,* js 大数相加
 ,* 字符串拼接，用加法法则计算
 ,* @param { string } a
 ,* @param { string } b
 ,* @returns string
 ,*/
function sumBigNumber(a, b) {
  let res = "",
    temp = 0;

  /** @type {string[]} */
  const arrA = a.split("");
  /** @type {string[]} */
  const arrB = b.split("");

  while (arrA.length || arrB.length || temp) {
    // ~~ 将操作数转换成 int
    temp += ~~arrA.pop() + ~~arrB.pop();
    res = (temp % 10) + res;
    temp = temp > 9 ? 1 : 0;
  }

  // 删掉头部的 0
  return res.replace(/^0+/, "");
}

#+end_src

* Debounce

防抖

例子：用户在 input 框输入，一段时间没有输入后，再发起网络请求

#+begin_src js
function debounce(fn, time) {
  let timeout;
  return function () {
    const func = () => fn.apply(this, arguments);
    clearTimeout(timeout);
    timeout = setTimeout(func, time);
  };
}
#+end_src

* Throttle

节流, 每隔一段时间执行一次

例子： 滚动条滚动使，没必要响应每次滚动事件，每隔500ms响应一次即可

#+begin_src js
function throttle(fn, time) {
  let timer;
  return function () {
    if (timer) {
      return;
    }
    let func = () => {
      fn.apply(this, arguments);
      timer = null;
    };
    timer = setTimeout(func, time);
  };
}
#+end_src
